src/DataProcessors/ЗагрузкаКоэффициентовСотрудников/ЗагрузкаКоэффициентовСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКоэффициентовСотрудников</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/КоэффициеныСотрудников/КоэффициеныСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоэффициеныСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>КоэффициентНаМВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ЗагрузкаКоэффициентовСотрудников/Forms/Форма/Module.bsl
&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Объект.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ФИО,КоэффициентНаМВ)
Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ФИО,Истина);
	Если Не Сотрудник.Пустая() Тогда
	РКС = РегистрыСведений.КоэффициеныСотрудников.ПолучитьПоследнее(Объект.НаДату,Новый Структура("Сотрудник",Сотрудник));
		Если РКС.КоэффициентНаМВ <> КоэффициентНаМВ Тогда
		РКС = РегистрыСведений.КоэффициеныСотрудников.СоздатьМенеджерЗаписи();
		РКС.Период = Объект.НаДату;
	    РКС.Сотрудник = Сотрудник;
	    РКС.КоэффициентНаМВ = КоэффициентНаМВ;
		РКС.Записать(Истина);
		КонецЕсли; 	
	Иначе
	Сообщить(ФИО + " - не найден!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c коэфф. сотрудников");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка коэфф. сотрудников..."); 
        ЗагрузитьНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),ExcelЛист.Cells(к,2).Value);
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры
